XMegaForArduino/arduino/variants/xmega128a1/pins_arduino.h
// default "no shift" pin assignments

// default SPI
static const uint8_t SS   = 12;
static const uint8_t MOSI = 13;
static const uint8_t MISO = 14;
static const uint8_t SCK  = 15;

// primary SPI on PC4-7
static const uint8_t SS0   = 12;
static const uint8_t MOSI0 = 13;
static const uint8_t MISO0 = 14;
static const uint8_t SCK0  = 15;

// secondary SPI on PD4-7
static const uint8_t SS1   = 4;
static const uint8_t MOSI1 = 5;
static const uint8_t MISO1 = 6;
static const uint8_t SCK1  = 7;

// default 2-wire on PE0,PE1 - TWIE  (for TWIC, you're on your own)
// NOTE:  TWIE appears it may be broken, so switch to TWIC?
static const uint8_t SDA = 16;
static const uint8_t SCL = 17;

// TODO:  alternate 2-wire ports

// keep track of the indices for port R since its control register
// settings should be slightly different - D manual table 11-6
#define PR0 60
#define PR1 61

#endif // DIGITAL_IO_PIN_SHIFT


// default 'status' LED on PR1
static const uint8_t LED_BUILTIN = PR1;


static const uint8_t A0 = 62;
static const uint8_t A1 = 63;
static const uint8_t A2 = 64;
static const uint8_t A3 = 65;
static const uint8_t A4 = 66;
static const uint8_t A5 = 67;
static const uint8_t A6 = 68;
static const uint8_t A7 = 69;
static const uint8_t A8 = 70;
static const uint8_t A9 = 71;
static const uint8_t A10 = 72;
static const uint8_t A11 = 73;
static const uint8_t A12 = 74;
static const uint8_t A13 = 75;
static const uint8_t A14 = 76;
static const uint8_t A15 = 77;

// on the xmega, PA2, PB2, PC2, PD2, and PE2 are asynchronous ints.  Others are 'synchronous' which means
// that they must be held in their 'interrupt state' long enough for the system to detect them.  In any case
// all digital input pins can be use as interrupts, synchronous or otherwise.


// this is the megaxxxx code
//// A majority of the pins are NOT PCINTs, SO BE WARNED (i.e. you cannot use them as receive pins)
//// Only pins available for RECEIVE (TRANSMIT can be on any pin):
//// (I've deliberately left out pin mapping to the Hardware USARTs - seems senseless to me)
//// Pins: 10, 11, 12, 13,  50, 51, 52, 53,  62, 63, 64, 65, 66, 67, 68, 69
//
//// NOTE:  these have to be completely re-written to work on the xmega
//

// TODO:  write this?  for now, leave it out

// old mega code for reference
#if 0
#define digitalPinToPCICR(p)    ( (((p) >= 10) && ((p) <= 13)) || \
                                  (((p) >= 50) && ((p) <= 53)) || \
                                  (((p) >= 62) && ((p) <= 69)) ? (&PCICR) : ((uint8_t *)0) )

#define digitalPinToPCICRbit(p) ( (((p) >= 10) && ((p) <= 13)) || (((p) >= 50) && ((p) <= 53)) ? 0 : \
                                ( (((p) >= 62) && ((p) <= 69)) ? 2 : \
                                0 ) )

#define digitalPinToPCMSK(p)    ( (((p) >= 10) && ((p) <= 13)) || (((p) >= 50) && ((p) <= 53)) ? (&PCMSK0) : \
                                ( (((p) >= 62) && ((p) <= 69)) ? (&PCMSK2) : \
                                ((uint8_t *)0) ) )

#define digitalPinToPCMSKbit(p) ( (((p) >= 10) && ((p) <= 13)) ? ((p) - 6) : \
                                ( ((p) == 50) ? 3 : \
                                ( ((p) == 51) ? 2 : \
                                ( ((p) == 52) ? 1 : \
                                ( ((p) == 53) ? 0 : \
                                ( (((p) >= 62) && ((p) <= 69)) ? ((p) - 62) : \
                                0 ) ) ) ) ) )
#endif // 0



#ifdef ARDUINO_MAIN

const uint16_t PROGMEM port_to_mode_PGM[] = {
  NOT_A_PORT,             // 0
  (uint16_t) &PORTA_DIR,       // PA
  (uint16_t) &PORTB_DIR,       // PB
  (uint16_t) &PORTC_DIR,       // PC
  (uint16_t) &PORTD_DIR,       // PD
  (uint16_t) &PORTE_DIR,       // PE
  (uint16_t) &PORTR_DIR,       // PR
  (uint16_t) &PORTF_DIR,       // PG
  (uint16_t) &PORTH_DIR,       // PH
  (uint16_t) &PORTJ_DIR,       // PJ
  (uint16_t) &PORTK_DIR,       // PK
  (uint16_t) &PORTQ_DIR,       // PQ
};

const uint16_t PROGMEM port_to_output_PGM[] = {
  NOT_A_PORT,              // 0
  (uint16_t) &PORTA_OUT,       // PA
  (uint16_t) &PORTB_OUT,       // PB
  (uint16_t) &PORTC_OUT,       // PC
  (uint16_t) &PORTD_OUT,       // PD
  (uint16_t) &PORTE_OUT,       // PE
  (uint16_t) &PORTR_OUT,       // PR
  (uint16_t) &PORTF_OUT,       // PG
  (uint16_t) &PORTH_OUT,       // PH
  (uint16_t) &PORTJ_OUT,       // PJ
  (uint16_t) &PORTK_OUT,       // PK
  (uint16_t) &PORTQ_OUT,       // PQ
};

const uint16_t PROGMEM port_to_input_PGM[] = {
  NOT_A_PORT,             // 0
  (uint16_t) &PORTA_IN,       // PA
  (uint16_t) &PORTB_IN,       // PB
  (uint16_t) &PORTC_IN,       // PC
  (uint16_t) &PORTD_IN,       // PD
  (uint16_t) &PORTE_IN,       // PE
  (uint16_t) &PORTR_IN,       // PR
  (uint16_t) &PORTF_IN,       // PG
  (uint16_t) &PORTH_IN,       // PH
  (uint16_t) &PORTJ_IN,       // PJ
  (uint16_t) &PORTK_IN,       // PK
  (uint16_t) &PORTQ_IN,       // PQ
};

// xmega has a per-pin config register as well.  Normally these will be 00000111 for analog, 00000000 for digital 'totem pole'
// for 'INPUT_PULLUP' these will be 00011111
//   bits 2:0 (trigger)  000 both edges  001 rising  010 falling  011 level  111 input buffer disabled
//            note:  'input buffer disabled' required to use the 'IN' register (so default here)
//                   also port R does not support 'INTPUT_DISABLED' (sic) so use BOTHEDGES [0] instead
//   bits 5:3 (out/pull) 000 TOTEM [normal], 001 bus keeper [sticky], 010 pulldown, 011 pullup,
//                       100 wired 'or', 101 wired 'and', 110 wired 'or' pulldown, 111 wired 'and' pullup
//   bit 6:  "invert logic" (0 = normal, 1 = inverted)
//   bit 7:  unused, must be zero
// NOTE:  PORTA through PORTE (PORTF?) support 'input buffer disabled' and this setting is recommended
//        for analog inputs.  PORTR apparently does NOT support this (set to zero?)

const uint16_t PROGMEM digital_pin_to_control_PGM[] = {
#ifndef DIGITAL_IO_PIN_SHIFT
  (uint16_t) &PORTD_PIN0CTRL,  // PD 0 ** 0 **
  (uint16_t) &PORTD_PIN1CTRL,  // PD 1 ** 1 **
#endif // DIGITAL_IO_PIN_SHIFT
  (uint16_t) &PORTD_PIN2CTRL,  // PD 2 ** 2 ** USARTD_RX     ASYNC
  (uint16_t) &PORTD_PIN3CTRL,  // PD 3 ** 3 ** USARTD_TX
  (uint16_t) &PORTD_PIN4CTRL,  // PD 4 ** 4 **
  (uint16_t) &PORTD_PIN5CTRL,  // PD 5 ** 5 **
  (uint16_t) &PORTD_PIN6CTRL,  // PD 6 ** 6 **
  (uint16_t) &PORTD_PIN7CTRL,  // PD 7 ** 7 **
  (uint16_t) &PORTC_PIN0CTRL,  // PC 0 ** 8 **
  (uint16_t) &PORTC_PIN1CTRL,  // PC 1 ** 9 **
  (uint16_t) &PORTC_PIN2CTRL,  // PC 2 ** 10 **              ASYNC
  (uint16_t) &PORTC_PIN3CTRL,  // PC 3 ** 11 **
  (uint16_t) &PORTC_PIN4CTRL,  // PC 4 ** 12 ** SPI_SS
  (uint16_t) &PORTC_PIN5CTRL,  // PC 5 ** 13 ** SPI_MOSI
  (uint16_t) &PORTC_PIN6CTRL,  // PC 6 ** 14 ** SPI_MISO
  (uint16_t) &PORTC_PIN7CTRL,  // PC 7 ** 15 ** SPI_SCK
  (uint16_t) &PORTE_PIN0CTRL,  // PE 0 ** 16 ** SDA
  (uint16_t) &PORTE_PIN1CTRL,  // PE 1 ** 17 ** SCL
  (uint16_t) &PORTE_PIN2CTRL,  // PE 2 ** 18 **              ASYNC
  (uint16_t) &PORTE_PIN3CTRL,  // PE 3 ** 19 **

