XMegaForArduino/arduino/variants/xmega128a1/pins_arduino.h
  // TODO:  correctly implement for xmega - PORTC, PORTD, and PORTE are all PWM capable!

#ifndef DIGITAL_IO_PIN_SHIFT
  TIMERD2,       // PD 0 ** 0 **
  TIMERD2,       // PD 1 ** 1 **
#endif // DIGITAL_IO_PIN_SHIFT
  TIMERD2,       // PD 2 ** 2 ** USARTD_RX
  TIMERD2,       // PD 3 ** 3 ** USARTD_TX
  TIMERD2,       // PD 4 ** 4 **
  TIMERD2,       // PD 5 ** 5 **
  TIMERD2,       // PD 6 ** 6 **
  TIMERD2,       // PD 7 ** 7 **
  TIMERC2,       // PC 0 ** 8 **
  TIMERC2,       // PC 1 ** 9 **
  TIMERC2,       // PC 2 ** 10 **
  TIMERC2,       // PC 3 ** 11 **
  TIMERC2,       // PC 4 ** 12 ** SPI_SS
  TIMERC2,       // PC 5 ** 13 ** SPI_MOSI
  TIMERC2,       // PC 6 ** 14 ** SPI_MISO
  TIMERC2,       // PC 7 ** 15 ** SPI_SCK

  TIMERE2,       // PE 0 ** 16 ** SDA
  TIMERE2,       // PE 1 ** 17 ** SCL
  TIMERE2,       // PE 2 ** 18 **
  TIMERE2,       // PE 3 ** 19 **
  TIMERE2,       // PE 4 ** 20 **
  TIMERE2,       // PE 5 ** 21 **
  TIMERE2,       // PE 6 ** 22 **
  TIMERE2,       // PE 7 ** 23 **

  TIMERF2,       // PF 0 ** 24 **
  TIMERF2,       // PF 1 ** 25 **
  TIMERF2,       // PF 2 ** 26 **
  TIMERF2,       // PF 3 ** 27 **
  TIMERF2,       // PF 4 ** 28 **
  TIMERF2,       // PF 5 ** 29 **
  TIMERF2,       // PF 6 ** 30 **
  TIMERF2,       // PF 7 ** 31 **

  TIMERH2,       // PH 0 ** 32 **
  TIMERH2,       // PH 1 ** 33 **
  TIMERH2,       // PH 2 ** 34 **
  TIMERH2,       // PH 3 ** 35 **
  TIMERH2,       // PH 4 ** 36 **
  TIMERH2,       // PH 5 ** 37 **
  TIMERH2,       // PH 6 ** 38 **
  TIMERH2,       // PH 7 ** 39 **

  TIMERJ2,       // PJ 0 ** 40 **
  TIMERJ2,       // PJ 1 ** 41 **
  TIMERJ2,       // PJ 2 ** 42 **
  TIMERJ2,       // PJ 3 ** 43 **
  TIMERJ2,       // PJ 4 ** 44 **
  TIMERJ2,       // PJ 5 ** 45 **
  TIMERJ2,       // PJ 6 ** 46 **
  TIMERJ2,       // PJ 7 ** 47 **

  TIMERK2,       // PK 0 ** 48 **
  TIMERK2,       // PK 1 ** 49 **
  TIMERK2,       // PK 2 ** 50 **
  TIMERK2,       // PK 3 ** 51 **
  TIMERK2,       // PK 4 ** 52 **
  TIMERK2,       // PK 5 ** 53 **
  TIMERK2,       // PK 6 ** 54 **
  TIMERK2,       // PK 7 ** 55 **

  TIMERQ0,       // PQ 0 ** 56 **
  TIMERQ0,       // PQ 1 ** 57 **
  TIMERQ0,       // PQ 2 ** 58 **
  TIMERQ0,       // PQ 3 ** 59 **

  NOT_ON_TIMER,  // PR 0 ** 60 **
  NOT_ON_TIMER,  // PR 1 ** 61 ** default LED
#ifdef DIGITAL_IO_PIN_SHIFT
  TIMERD2,       // PD 0 ** the new 60 **
  TIMERD2,       // PD 1 ** the new 61 **
#endif // DIGITAL_IO_PIN_SHIFT
  NOT_ON_TIMER,  // PA 0 ** 62 ** A0
  NOT_ON_TIMER,  // PA 1 ** 63 ** A1
  NOT_ON_TIMER,  // PA 2 ** 64 ** A2
  NOT_ON_TIMER,  // PA 3 ** 65 ** A3
  NOT_ON_TIMER,  // PA 4 ** 66 ** A4
  NOT_ON_TIMER,  // PA 5 ** 67 ** A5
  NOT_ON_TIMER,  // PA 6 ** 68 ** A6
  NOT_ON_TIMER,  // PA 7 ** 69 ** A7
  NOT_ON_TIMER,  // PB 0 ** 70 ** A8
  NOT_ON_TIMER,  // PB 1 ** 71 ** A9
  NOT_ON_TIMER,  // PB 2 ** 72 ** A10
  NOT_ON_TIMER,  // PB 3 ** 73 ** A11
  NOT_ON_TIMER,  // PB 4 ** 74 ** A12
  NOT_ON_TIMER,  // PB 5 ** 75 ** A13
  NOT_ON_TIMER,  // PB 6 ** 76 ** A14
  NOT_ON_TIMER,  // PB 7 ** 77 ** A15

};

#endif

#endif


